Revit 2026 API

# CompoundStructureLayer Class

---

Describes a single layer in a CompoundStructure.

SystemObject Autodesk.Revit.DBCompoundStructureLayer

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CompoundStructureLayer : IDisposable
```
```vb
Public Class CompoundStructureLayer
	Implements IDisposable
```
```cpp
public ref class CompoundStructureLayer : IDisposable
```
```fsharp
type CompoundStructureLayer =
    class
        interface IDisposable
    end
```

The CompoundStructureLayer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CompoundStructureLayer | Creates a compound structure layer using default settings. |
|  | CompoundStructureLayer(CompoundStructureLayer) | Creates a copy of a compound structure layer. |
|  | CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId) | Creates a default compound structure layer based on the given width, function and material element id. The priority is initialized with 999. |

|  | Name | Description |
| --- | --- | --- |
|  | DeckEmbeddingType | Embedding type for structural deck - only for a layer whose function is StructuralDeck. |
|  | DeckProfileId | The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck. |
|  | Function | The function of the layer. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LayerCapFlag | Identifies if the layer participates in wrapping at end caps and/or inserts. |
|  | LayerId | The id of the layer - note that this may be different from the index in the array of layers in a CompoundStructure. |
|  | LayerPriority | The priority of the layer. |
|  | MaterialId | Id of the material assigned to this layer. |
|  | Width | Width of the layer. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CompoundStructureLayer |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace